index="sysmon" source="WinEventLog:Sysmon" EventCode=3 DestinationPort=443
| bin span=1m _time
| mvexpand User
| search (User!="SYSTEM" AND User!="NT AUTHORITY\\*")
| stats count by _time, SourceIp, User, Image
| where count < 3
| bin span=15m _time
| stats count by _time, SourceIp, User, Image
| where count > 13
